program Project1;

{Выполнил Арцибасов А.В. Вариант №1. Определить вид четырехугольника и длины его сторон}

var
  i: integer; //переменная для цикла
  L: integer; //переменная вида четырехугольника
  x: array[1..4] of integer; //координата x
  y: array[1..4] of integer;//координата y

begin
  L := 0; //флажок неопределенности четырехугольника
  writeln('Введите координаты четырех точек (целые числа)'); //Требование ввода координат четырех точек
  for i := 1 to 4 do begin
                     readln(x[i], y[i]); //присваивание координатам x и y определенных значений
                     writeln (ord(x[i]));
                     if ord(x[i])<>x[i] then writeln ('Вышел за диапазон');
                     end;
  if ((x[1] - x[2]) * (y[3] - y[4]) = (y[1] - y[2]) * (x[3] - x[4])) then begin//проверка параллельности сторон 1-2 и 3-4
    if ((x[1] - x[4]) * (y[2] - y[3]) = (y[1] - y[4]) * (x[2] - x[3])) then begin//проверка параллельности сторон 2-3 и 4-1
      if ((x[1] - x[2]) * (x[2] - x[3]) = (y[1] - y[2]) * (y[2] - y[3])) then begin//проверка наличия прямого угла между сторонами 1-2 и 2-3
        if ((x[1] - x[2]) * (x[1] - x[2]) + (y[1] - y[2]) * (y[1] - y[2])) = ((x[2] - x[3]) * (x[2] - x[3]) + (y[2] - y[3]) * (y[2] - y[3])) then L := 4 //флажок определенности четырехугольника (квадрат)
        else L := 3; //флажок определенности четырехугольника (прямоугольник)
      end
      else L := 2; //флажок определенности четырехугольника (параллелограмм)
    end
    else L := 1; //флажок определенности четырехугольника (трапеция)
  end
  else if ((x[1] - x[4]) * (y[2] - y[3]) = (y[1] - y[4]) * (x[2] - x[3])) then L := 1; //флажок определенности четырехугольника (трапеция)
  if L > 0 then begin
    writeln(#201, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #203, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #203, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #203, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #203, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #187); //создание верхней грани таблицы
    writeln(#186, 'Вид четырехугольника', #186, 'сторона 1-2', #186, 'сторона 2-3', #186, 'сторона 3-4', #186, 'сторона 4-1', #186); //названия столбцов
    writeln(#204, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #206, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #206, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #206, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #206, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #185); //создание средней грани таблицы
    write(#186);
    if L = 4 then write('Квадрат             '); //вывод "квадрат"
    if L = 3 then write('Прямоугольник       '); //вывод "прямоугольник"
    if L = 2 then write('Параллелограмм      '); //вывод "параллелограмм"
    if L = 1 then write('Трапеция            '); //вывод "трапеция"
    writeln(#186, round(exp(1 / 2 * ln((x[1] - x[2]) * (x[1] - x[2]) + (y[1] - y[2]) * (y[1] - y[2])))):7, '    ', #186, //ввод вида четырехугольника и значения стороны 1-2
                                                                                                round(exp(1 / 2 * ln((x[2] - x[3]) * (x[2] - x[3]) + (y[2] - y[3]) * (y[2] - y[3])))):7, '    ', #186, //ввод вида четырехугольника и значения стороны 2-3
                                                                                                round(exp(1 / 2 * ln((x[3] - x[4]) * (x[3] - x[4]) + (y[3] - y[4]) * (y[3] - y[4])))):7, '    ', #186, //ввод вида четырехугольника и значения стороны 3-4
                                                                                                round(exp(1 / 2 * ln((x[1] - x[4]) * (x[1] - x[4]) + (y[1] - y[4]) * (y[1] - y[4])))):7, '    ', #186); //ввод вида четырехугольника и значения стороны 4-1
    writeln(#200, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #202, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #202, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #202, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #202, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #205, #188); //создание нижней грани таблицы
  end
  else writeln('Введен четырехугольник непредусмотренного вида'); //предусмотрение случая ввода непредусмотренного четырехугольника
  readln(i); //команда для остановки преждевременного окончания программы
end.

